Lesson5_proj/src/Documents/Продажа/Продажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Продажа</name>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Lesson5_proj/src/Documents/Продажа/Forms/DocumentForm/Module.bsl
// @strict-types

#Region FormTableItemsEventHandlersТовары
&AtClient
Procedure ТоварыКоличествоOnChange(Item)
	ПересчетТекущейСтроки();
EndProcedure

&AtClient
Procedure ТоварыЦенаOnChange(Item)
	ПересчетТекущейСтроки();
EndProcedure

#EndRegion


#Region Private

&AtClient
Procedure ПересчетТекущейСтроки()

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество*ТекущиеДанные.Цена;
	
	Object.Сумма = Object.Товары.Итог("Сумма");
	
EndProcedure

#EndRegion
